#include "freertos/FreeRTOS.h"
#include "freertos/event_groups.h"
#include "esp_system.h"
#include "esp_wifi.h"
#include "esp_event_loop.h"
#include "esp_log.h"



static char *lunarMonthName[] = {
            "腊", "正", "二", "三",
            "四", "五", "六", "七",
            "八", "九", "十", "冬"
    };
static char *lunarDayName[] = {
        "三十", "初一", "初二", "初三", "初四", "初五", "初六", "初七", "初八", "初九",
        "初十", "十一", "十二", "十三", "十四", "十五", "十六", "十七", "十八", "十九",
        "二十", "廿一", "廿二", "廿三", "廿四", "廿五", "廿六", "廿七", "廿八", "廿九"
};
//天干
static char *nature[] = {
        "癸", "甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬"
};

//地支
static char *earth[] = {
        "亥", "子", "丑", "寅", "卯", "辰", "巳", "午", "末", "申", "酉", "戌"
};

//属相名
static char *animal[] = {
        "猪", "鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗"
};

//节气
static char *solarTerm[] = {
        "大雪", "冬至", "小寒", "大寒", "立春", "雨水",
        "惊蛰", "春分", "清明", "谷雨", "立夏", "小满",
        "芒种", "夏至", "小暑", "大暑", "立秋", "处暑",
        "白露", "秋分", "寒露", "霜降", "立冬", "小雪"
};


